Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextPlacings
The placing types of the dimension value text.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextPlacings.AboveDimensionLine
The dimension value text is placed above the dimension line.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextPlacings.OnDimensionLine
The dimension value text is placed on the dimension line.